// Echarts图表配置
var renKouDOM = document.getElementById('renkou');
var renKou = echarts.init(renKouDOM,  theme='dark');

// 生成数组
function generateArray (start, end) {
  return Array.from(new Array(end + 1).keys()).slice(start)
}

// 人口数量、人口自然增长率柱折混合图
const renKouTimeList = generateArray(2003, 2019)
console.log(renKouTimeList)
let renKouOption = {
  tooltip: {
    trigger: 'axis',
    axisPointer: {
      type: 'shadow'
    }
  },
  backgroundColor: 'transparent',
  title: {
    text: '2003年至2019年东北三省人口总量及人口自然增长率变化图',
    subtext: '数据来源：历年《中国人口普查年鉴》',
    top: 0,
    left: 'center'
  },
  toolbox: {
    feature: {
      saveAsImage: {}
    }
  },
  legend: {
    bottom: 0,
    left: 'center'
  },
  grid: {
    left: '3%',
    right: '4%',
    bottom: '10%',
    containLabel: true
  },
  xAxis: [
    {
      type: 'category',
      data: renKouTimeList
    }
  ],
  yAxis: [
    {
      name: '人口总量',
      type: 'value'
    },
    {
      type: 'value',
      name: '人口自然增长率',
      axisLabel: {
        formatter: '{value} %'
      }
    }
  ],
  series: [
    {
      name: '吉林人口总量',
      type: 'bar',
      emphasis: {
        focus: 'series'
      },
      stack: '人口总数',
      data: [
      2703.7,
      2709,
      2716,
      2723,
      2730,
      2734,
      2739.55,
      2746.6021,
      2749.41,
      2750.4,
      2751.28,
      2752.38,
      2753.32,
      2733,
      2717,
      2704,
      2691,
      ]
    },
    {
      name: '辽宁人口总量',
      type: 'bar',
      stack: '人口总数',
      emphasis: {
        focus: 'series'
      },
      data: [
        4210,
        4217,
        4221,
        4271,
        4298,
        4314.7,
        4319,
        4374.9,
        4383,
        4389,
        4390,
        4391,
        4382.4,
        4378,
        4369,
        4359,
        4352,
      ]
    },
    {
      name: '黑龙江人口总量',
      type: 'bar',
      stack: '人口总数',
      emphasis: {
        focus: 'series'
      },
      data: [
        3815,
        3817,
        3820,
        3823,
        3824,
        3825.39,
        3826,
        3833.4024,
        3834,
        3834,
        3835.02,
        3833,
        3811.7,
        3799,
        3788.7,
        3773,
        3751    
      ]
    },
    {
      name: '吉林省人口自然增长率',
      type: 'line',
      yAxisIndex: 1,
      tooltip: {
        valueFormatter: function (value) {
          return value + ' %';
        }
      },
      data: [
        1.61,
        1.76,
        2.57,
        2.67,
        2.5,
        1.61,
        1.95,
        2.03,
        1.02,
        0.36,
        0.32,
        0.4,
        0.34,
        -0.05,
        0.26,
        0.36,
        -0.85,
      ]
    },
    {
      name: '辽宁省人口自然增长率',
      type: 'line',
      yAxisIndex: 1,
      tooltip: {
        valueFormatter: function (value) {
          return value + ' %';
        }
      },
      data: [
        1.07,
        0.91,
        0.97,
        1.1,
        1.53,
        1.1,
        0.97,
        0.42,
        -0.34,
        -0.39,
        -0.03,
        0.26,
        -0.42,
        -0.18,
        -0.44,
        -1,
        -0.8
      ]
    },
    {
      name: '黑龙江省人口自然增长率',
      type: 'line',
      yAxisIndex: 1,
      tooltip: {
        valueFormatter: function (value) {
          return value + ' %';
        }
      },
      data: [
        2.03,
        1.82,
        2.67,
        2.39,
        2.49,
        2.23,
        2.06,
        2.32,
        1.07,
        1.27,
        0.78,
        0.91,
        -0.6,
        -0.49,
        -0.41,
        -0.69,
        -0.1,
      ],
    },
  ]
};

renKouOption && renKou.setOption(renKouOption);

// 人口结构
var rkjgDOM = document.getElementById('renkoujiegou');
var rkjg = echarts.init(rkjgDOM, theme='dark');

let rkjgOption = {
  title: {
    top: 0,
    left: 'center',
    text: '2003年至2019年东北三省人口结构变化图',
    subtext: '数据来源：历年《中国人口普查年鉴》'
  },
  backgroundColor: 'transparent',
  tooltip: {
    trigger: 'axis',
    axisPointer: {
      type: 'cross',
      label: {
        backgroundColor: '#6a7985'
      }
    }
  },
  legend: {
    bottom: 0,
    left: 'center',
    data: ['65岁以上', '15-65岁', '0-14岁']
  },
  toolbox: {
    feature: {
      saveAsImage: {}
    }
  },
  grid: {
    left: '3%',
    right: '4%',
    bottom: '10%',
    containLabel: true
  },
  xAxis: [
    {
      type: 'category',
      boundaryGap: false,
      data: generateArray(2003, 2019)
    }
  ],
  yAxis: [
    {
      type: 'value',
      max: 1
    }
  ],
  series: [
    {
      name: '0-14岁',
      type: 'line',
      stack: 'Total',
      areaStyle: {},
      emphasis: {
        focus: 'series'
      },
      data: [0.152424775,0.141255562,0.145039702,0.131989608,0.129542236,0.123584431,0.117798687,0.117513386,0.118342706,0.114569679,0.112982766,0.11215131,0.109418841,0.109376772,0.106503773,0.108256736,0.105102085]
    },
    {
      name: '15-65岁',
      type: 'line',
      stack: 'Total',
      areaStyle: {},
      emphasis: {
        focus: 'series'
      },
      data: [0.768099379,0.778664165,0.770264618,0.776900058,0.77467188,0.77641975,0.783753187,0.791181376,0.788844461,0.795412825,0.79071413,0.780897075,0.77389247,0.768797911,0.764192762,0.758102223,0.749681444,]
    },
    {
      name: '65岁以上',
      type: 'line',
      stack: 'Total',
      areaStyle: {},
      emphasis: {
        focus: 'series'
      },
      data: [0.079475845,0.080080273,0.08469568,0.091110334,0.095785883,0.099995819,0.098448127,0.091305238,0.092812834,0.090017496,0.096303104,0.106951615,0.116688689,0.121825317,0.129303465,0.133641042,0.145216471,]
    },
  ]
};

rkjgOption && rkjg.setOption(rkjgOption);

// 人口迁移
function moveMap() {

  function getBaseOption() {
    return {
      // 需要全局设置 tooltip trigger 为 'item' 后，effectScatter series 的 tooltip 才会显示。
      tooltip: {
        trigger: "item",
        show: false,
      },
      title: {
        text: '2020年东北三省人口迁移情况',
        subtext: '数据来源：《2020年人口普查年鉴》',
        left: 'center',
        top: '5%'
      },
      backgroundColor: 'transparent',
      toolbox: {
        feature: {
          saveAsImage: {}
        }
      },    
      // 底图
      geo: {
        show: true,
        map: "china",
        zoom: 1.1,
        label: {
          normal: {
            show: false,
          },
          emphasis: {
            show: true,
          },
        },
        roam: false,
        itemStyle: {
          normal: {
            areaColor: "rgba(0, 0, 0, 0)",
            borderWidth: 8, //设置外层边框
            borderColor: "#00FFD7",
            shadowColor: "rgba(63, 236, 209, 1)",
            shadowBlur: 40, //地图外层光晕
          },
        },
      },
      // 深色背景图层
      series: [
        {
          type: "map",
          map: "china",
          zoom: 1.1,
          geoIndex: 1,
          aspectScale: 0.75, // 长宽比, 默认值 0.75
          showLegendSymbol: false, // 存在legend时显示
          label: {
            normal: {
              show: false,
            },
            emphasis: {
              show: true,
              textStyle: {
                color: "#fff",
              },
            },
          },
          roam: false,
          itemStyle: {
            normal: {
              areaColor: "rgba(10, 29, 44, 0.9)",
              borderColor: "rgba(33, 120, 116, 0.6)",
              borderWidth: 1,
            },
            emphasis: {
              areaColor: "rgba(38, 107, 106, 0.6)",
            },
          },
        },
      ],
    };
  }
  function getDirectionOption(
    direction = "in",
    geoCoordMap = null,
    inSZCityData = [],
    outSZCityData = []
  ) {
    if (!geoCoordMap) {
      return;
    }

    if (direction === "in" && inSZCityData.length === 0) {
      return;
    }

    if (direction === "out" && outSZCityData.length === 0) {
      return;
    }

    const _directionData = direction === "in" ? inSZCityData : outSZCityData;
    const _toCityName =
      direction === "in" ? inSZCityData[0][1].name : outSZCityData[0][0].name;

    // 转换方法，给指向数据添加经纬度
    const _convertLinesData = (data) => {
      const _dataWithCoord = [];
      data.forEach((direction) => {
        const _fromCoord = geoCoordMap[direction[0].name];
        const _toCoord = geoCoordMap[direction[1].name];

        if (_fromCoord && _toCoord) {
          _dataWithCoord.push([
            {
              coord: _fromCoord,
            },
            {
              coord: _toCoord,
              value: direction[1].value,
            },
          ]);
        }
      });
      return _dataWithCoord;
    };

    const planeIconPath =
      "path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z";
    const _color = ["rgba(102, 255, 231, 1)"];

    const _series = JSON.parse(JSON.stringify(getBaseOption())).series;
    [[_toCityName, _directionData]].forEach((item, i) => {
      _series.push(
        {
          name: "地图飞线",
          type: "lines",
          zlevel: 1,
          // 线特效的配置
          effect: {
            show: true,
            // 特效动画的时间
            period: 6,
            // 特效尾迹的长度
            trailLength: 0.7,
            // 特效标记的颜色
            color: "#fff",
            // 特效标记的大小
            symbolSize: 3,
          },
          lineStyle: {
            normal: {
              color: _color[i],
              width: 0.8,
              // 边的曲度
              curveness: 0.2,
            },
          },
          data: _convertLinesData(item[1]),
        },
        {
          name: "城市散点",
          // 带有涟漪特效动画的散点（气泡）图
          type: "effectScatter",
          coordinateSystem: "geo",
          zlevel: 2,
          // 涟漪特效相关配置
          rippleEffect: {
            // 波纹的绘制方式,可选 'stroke' 和 'fill'
            brushType: "stroke",
          },
          label: {
            show: true,
            position: "right",
            formatter: "{b}",
          },
          // 散点大小
          symbolSize: function (val) {
            return val[2] / 8000;
          },
          itemStyle: {
            color: '#C50080',
          },
          // 格式化数据
          data: item[1].map(function (dataItem) {
            // 给散点增加一个value维度，数组长度由2变成3，加上了散点发散效果（以值控制发散效果的大小）
            const _cityName =
              direction === "in" ? dataItem[0].name : dataItem[1].name;
            return {
              name: _cityName,
              value: geoCoordMap[_cityName].concat([dataItem[1].value]),
            };
          }),
          tooltip: {
            trigger: "item",
            show: true,
            position: "top",
            formatter: (e) => {
              const { name, value } = e.data;
              return `<div class="map-tooltip-wrapper"><div class="tooltip-desc-title">${name}</div><div class="tooltip-desc">迁入数量：${
                value[2] || "-"
              } 人</div></div>`;
            },
          },
        }
      );
    });

    const _options = JSON.parse(JSON.stringify(getBaseOption()));
    _options.series = null;
    _options.series = _series;
    return _options;
  }
  function init(option = null) {
    if (!option) {
      return;
    }

    const _option = option;
    //   registerMap 需要再 echarts init 之前执行
    const moveMapDOM = document.getElementById('move')
    echarts.registerMap("china", chinaNoIslands);
    let moveMap = echarts.init(moveMapDOM, theme='dark');
    moveMap.setOption(_option, true);

    moveMap.off("click");
    moveMap.on("click", (params) => {});
  }


  // this.init(this.getBaseOption());
  // 初始化为热力图
  // this.init(this.getHeatmapOption(heatmapData));
  // 初始化为流向图(in 代表流入状态，out 代表流出状态)
  init(
    getDirectionOption("out", geoCoordMap, inSZCityData, outSZCityData)
  );
}
moveMap()

// GDP饼折混合图
var gdpDOM = document.getElementById('gdp');
var gdp = echarts.init(gdpDOM);
var gdpOption;
var gdpTimeList = generateArray(2003, 2020);
gdpTimeList = gdpTimeList.map(item => String(item))
gdpTimeList.unshift('年份')
setTimeout(function () {
  gdpOption = {
    title: {
      text: '2003年至2020年东北三省GDP总量变化图',
      subtext: '数据来源：国家统计局',
      top: 0,
      left: 'center'
    },
    legend: {
      bottom: 0,
      left: 'center'
    },  
    tooltip: {
      trigger: 'axis',
      showContent: true
    },
    dataset: {
      source: [
        gdpTimeList,
        ['黑龙江', 3609.7,4134.7,4756.4,5329.8,6126.3,7134.2,7218.9,8308.3,9935,13691.6,14454.9,15039.4,15083.67,15386.09,16199.9,16361.6,13612.7,13698.5],
        ['吉林', 2662.08,2958.21,3620.3,4275.12,5284.69,6426.1,7278.75,8667.6,10530.71,11939.24,13046.4,13803.14,14063.13,14776.8,15288.9,15074.6,11726.8,12311.3],
        ['辽宁', 6002.5,6736.1,8047.3,9388.9,11249,13745.3,15288.7,18457.3,22226.7,24846.4,27213.2,28626.6,28669.02,22037.88,23942,25315.4,24909.5,25115],
        ['其它省份', 123378.76,144534.98,175998.77,203232.48,246874.45,292328.75,320406.94,383042.09,450510.06,526408.13,579890.22,627159.56,633607.4,720573.22,800537.35,857956.07,935084.12,961290.29]
      ]
    },
    xAxis: { type: 'category' },
    yAxis: { gridIndex: 0 },
    grid: { top: '55%' },
    series: [
      {
        type: 'line',
        smooth: true,
        seriesLayoutBy: 'row',
        emphasis: { focus: 'series' }
      },
      {
        type: 'line',
        smooth: true,
        seriesLayoutBy: 'row',
        emphasis: { focus: 'series' }
      },
      {
        type: 'line',
        smooth: true,
        seriesLayoutBy: 'row',
        emphasis: { focus: 'series' }
      },
      {
        type: 'pie',
        id: '年份',
        radius: '30%',
        center: ['50%', '30%'],
        emphasis: {
          focus: 'self'
        },
        label: {
          formatter: '{b}: {@2003} ({d}%)'
        },
        encode: {
          itemName: '年份',
          value: '2003',
          tooltip: '2003'
        }
      }
    ]
  };
  gdp.on('updateAxisPointer', function (event) {
    const xAxisInfo = event.axesInfo[0];
    if (xAxisInfo) {
      const dimension = xAxisInfo.value + 1;
      gdp.setOption({
        series: {
          id: '年份',
          label: {
            formatter: '{b}: {@[' + dimension + ']} ({d}%)'
          },
          encode: {
            value: dimension,
            tooltip: dimension
          }
        }
      });
    }
  });
  gdp.setOption(gdpOption);
});

gdpOption && myChart.setOption(gdpOption);

// 人均收入
var incomeDOM = document.getElementById('income');
var income = echarts.init(incomeDOM);
var incomeOption;

console.log('aa')
const data = [['Income', 'Country', 'Year'], [14535.0, '北京', 2003], [10313.0, '天津', 2003], [7188.0, '河北', 2003], [6977.0, '山西', 2003], [7012.9, '内蒙古', 2003], [7240.6, '辽宁', 2003], [7005.12, '吉林', 2003], [6679.0, '黑龙江', 2003], [14867.49, '上海', 2003], [9263.0, '江苏', 2003], [13180.0, '浙江', 2003], [6778.03, '安徽', 2003], [10000.0, '福建', 2003], [6901.42, '江西', 2003], [8400.0, '山东', 2003], [6926.12, '河南', 2003], [7322.0, '湖北', 2003], [7674.2, '湖南', 2003], [12380.4, '广东', 2003], [7785.0, '广西', 2003], [7259.0, '海南', 2003], [8093.67, '重庆', 2003], [7042.0, '四川', 2003], [6568.91, '贵州', 2003], [7643.57, '云南', 2003], [8058.0, '西藏', 2003], [6737.0, '陕西', 2003], [6803.0, '甘肃', 2003], [6731.88, '青海', 2003], [6530.0, '宁夏', 2003], [7006.0, '新疆', 2003], [16502.0, '北京', 2004], [11467.0, '天津', 2004], [7886.0, '河北', 2004], [7866.0, '山西', 2004], [8123.1, '内蒙古', 2004], [8007.6, '辽宁', 2004], [7840.6, '吉林', 2004], [7471.0, '黑龙江', 2004], [16683.0, '上海', 2004], [10482.0, '江苏', 2004], [14546.0, '浙江', 2004], [7511.43, '安徽', 2004], [11175.0, '福建', 2004], [7560.0, '江西', 2004], [9438.0, '山东', 2004], [7704.9, '河南', 2004], [8022.8, '湖北', 2004], [8617.5, '湖南', 2004], [13627.65, '广东', 2004], [8177.0, '广西', 2004], [7736.0, '海南', 2004], [9221.0, '重庆', 2004], [7710.0, '四川', 2004], [7322.04, '贵州', 2004], [8870.88, '云南', 2004], [8200.0, '西藏', 2004], [7403.0, '陕西', 2004], [7566.0, '甘肃', 2004], [7319.67, '青海', 2004], [7218.0, '宁夏', 2004], [7503.0, '新疆', 2004], [18775.0, '北京', 2005], [12639.0, '天津', 2005], [9020.0, '河北', 2005], [8866.0, '山西', 2005], [9247.0, '内蒙古', 2005], [9107.6, '辽宁', 2005], [8690.62, '吉林', 2005], [8273.0, '黑龙江', 2005], [18645.0, '上海', 2005], [12319.0, '江苏', 2005], [16294.0, '浙江', 2005], [8470.7, '安徽', 2005], [12321.0, '福建', 2005], [8619.7, '江西', 2005], [10745.0, '山东', 2005], [8668.0, '河南', 2005], [8786.0, '湖北', 2005], [8124.0, '湖南', 2005], [14770.0, '广东', 2005], [8917.0, '广西', 2005], [8124.0, '海南', 2005], [10243.5, '重庆', 2005], [8386.0, '四川', 2005], [8151.1, '贵州', 2005], [9265.9, '云南', 2005], [8567.0, '西藏', 2005], [8159.0, '陕西', 2005], [8323.0, '甘肃', 2005], [8271.0, '青海', 2005], [8093.6, '宁夏', 2005], [7990.2, '新疆', 2005], [21415.0, '北京', 2006], [14283.0, '天津', 2006], [10194.0, '河北', 2006], [9967.0, '山西', 2006], [10358.0, '内蒙古', 2006], [10369.6, '辽宁', 2006], [9775.07, '吉林', 2006], [9182.0, '黑龙江', 2006], [20667.9, '上海', 2006], [14084.0, '江苏', 2006], [18265.0, '浙江', 2006], [9771.1, '安徽', 2006], [13753.0, '福建', 2006], [9551.1, '江西', 2006], [12192.0, '山东', 2006], [9810.3, '河南', 2006], [9803.0, '湖北', 2006], [10504.7, '湖南', 2006], [16015.6, '广东', 2006], [9899.0, '广西', 2006], [9395.1, '海南', 2006], [11569.7, '重庆', 2006], [9350.0, '四川', 2006], [9116.6, '贵州', 2006], [10069.9, '云南', 2006], [8941.1, '西藏', 2006], [9125.0, '陕西', 2006], [9215.0, '甘肃', 2006], [9000.4, '青海', 2006], [9177.3, '宁夏', 2006], [8871.3, '新疆', 2006], [23752.0, '北京', 2007], [16357.0, '天津', 2007], [11550.0, '河北', 2007], [11487.0, '山西', 2007], [12378.0, '内蒙古', 2007], [12300.4, '辽宁', 2007], [11285.52, '吉林', 2007], [10245.0, '黑龙江', 2007], [23622.7, '上海', 2007], [16378.0, '江苏', 2007], [20574.0, '浙江', 2007], [11473.6, '安徽', 2007], [15505.0, '福建', 2007], [11222.0, '江西', 2007], [14265.0, '山东', 2007], [11477.1, '河南', 2007], [11485.0, '湖北', 2007], [12293.5, '湖南', 2007], [17699.3, '广东', 2007], [12200.0, '广西', 2007], [10996.9, '海南', 2007], [12590.8, '重庆', 2007], [11098.0, '四川', 2007], [10678.4, '贵州', 2007], [11496.1, '云南', 2007], [11130.9, '西藏', 2007], [10578.0, '陕西', 2007], [10380.0, '甘肃', 2007], [10276.1, '青海', 2007], [10859.3, '宁夏', 2007], [10313.4, '新疆', 2007], [26918.0, '北京', 2008], [19423.0, '天津', 2008], [13263.0, '河北', 2008], [13021.0, '山西', 2008], [14433.0, '内蒙古', 2008], [14393.0, '辽宁', 2008], [12829.45, '吉林', 2008], [11581.0, '黑龙江', 2008], [26675.0, '上海', 2008], [18680.0, '江苏', 2008], [22727.0, '浙江', 2008], [12990.0, '安徽', 2008], [17961.0, '福建', 2008], [12866.0, '江西', 2008], [16305.0, '山东', 2008], [13231.0, '河南', 2008], [13153.0, '湖北', 2008], [13821.2, '湖南', 2008], [19733.0, '广东', 2008], [14146.0, '广西', 2008], [12608.0, '海南', 2008], [14368.0, '重庆', 2008], [12633.0, '四川', 2008], [11759.0, '贵州', 2008], [13250.0, '云南', 2008], [12482.0, '西藏', 2008], [12613.0, '陕西', 2008], [11413.0, '甘肃', 2008], [11640.0, '青海', 2008], [12932.0, '宁夏', 2008], [11432.0, '新疆', 2008], [26738.0, '北京', 2009], [21402.0, '天津', 2009], [14718.0, '河北', 2009], [13997.0, '山西', 2009], [15849.0, '内蒙古', 2009], [15761.0, '辽宁', 2009], [14006.0, '吉林', 2009], [12566.0, '黑龙江', 2009], [28838.0, '上海', 2009], [20552.0, '江苏', 2009], [24611.0, '浙江', 2009], [14086.0, '安徽', 2009], [19577.0, '福建', 2009], [14022.0, '江西', 2009], [17811.0, '山东', 2009], [14372.0, '河南', 2009], [14367.0, '湖北', 2009], [15084.0, '湖南', 2009], [21575.0, '广东', 2009], [15451.0, '广西', 2009], [13751.0, '海南', 2009], [15749.0, '重庆', 2009], [13839.0, '四川', 2009], [12863.0, '贵州', 2009], [14424.0, '云南', 2009], [13544.0, '西藏', 2009], [14129.0, '陕西', 2009], [11930.0, '甘肃', 2009], [12692.0, '青海', 2009], [14025.0, '宁夏', 2009], [12258.0, '新疆', 2009], [32132.0, '北京', 2010], [24293.0, '天津', 2010], [16263.0, '河北', 2010], [15648.0, '山西', 2010], [18050.0, '内蒙古', 2010], [17713.0, '辽宁', 2010], [15411.0, '吉林', 2010], [13857.0, '黑龙江', 2010], [31838.0, '上海', 2010], [22944.0, '江苏', 2010], [27359.0, '浙江', 2010], [15788.0, '安徽', 2010], [21781.0, '福建', 2010], [15481.0, '江西', 2010], [19946.0, '山东', 2010], [15930.0, '河南', 2010], [16058.0, '湖北', 2010], [15581.0, '湖南', 2010], [23898.0, '广东', 2010], [17064.0, '广西', 2010], [15581.0, '海南', 2010], [18991.0, '重庆', 2010], [15461.0, '四川', 2010], [14143.0, '贵州', 2010], [16065.0, '云南', 2010], [14980.0, '西藏', 2010], [15343.0, '陕西', 2010], [13189.0, '甘肃', 2010], [13855.0, '青海', 2010], [15344.0, '宁夏', 2010], [13644.0, '新疆', 2010], [32903.0, '北京', 2011], [26921.0, '天津', 2011], [18292.0, '河北', 2011], [18124.0, '山西', 2011], [20408.0, '内蒙古', 2011], [20467.0, '辽宁', 2011], [17797.0, '吉林', 2011], [15696.0, '黑龙江', 2011], [36230.0, '上海', 2011], [26341.0, '江苏', 2011], [30971.0, '浙江', 2011], [18606.0, '安徽', 2011], [24907.0, '福建', 2011], [17495.0, '江西', 2011], [22792.0, '山东', 2011], [18195.0, '河南', 2011], [18374.0, '湖北', 2011], [18844.0, '湖南', 2011], [26897.0, '广东', 2011], [18854.0, '广西', 2011], [18369.0, '海南', 2011], [20250.0, '重庆', 2011], [17899.0, '四川', 2011], [16495.0, '贵州', 2011], [18576.0, '云南', 2011], [16196.0, '西藏', 2011], [18245.0, '陕西', 2011], [14989.0, '甘肃', 2011], [15603.0, '青海', 2011], [17579.0, '宁夏', 2011], [15514.0, '新疆', 2011], [36469.0, '北京', 2012], [29626.0, '天津', 2012], [20543.44, '河北', 2012], [20411.7, '山西', 2012], [23150.3, '内蒙古', 2012], [23222.67, '辽宁', 2012], [20208.04, '吉林', 2012], [17760.0, '黑龙江', 2012], [40188.0, '上海', 2012], [29677.0, '江苏', 2012], [34550.0, '浙江', 2012], [21024.0, '安徽', 2012], [28055.0, '福建', 2012], [19860.0, '江西', 2012], [25755.0, '山东', 2012], [20443.0, '河南', 2012], [20839.59, '湖北', 2012], [21318.8, '湖南', 2012], [30227.0, '广东', 2012], [21243.0, '广西', 2012], [20918.0, '海南', 2012], [22968.14, '重庆', 2012], [20307.0, '四川', 2012], [18701.0, '贵州', 2012], [21075.0, '云南', 2012], [18028.0, '西藏', 2012], [20734.0, '陕西', 2012], [17979.0, '甘肃', 2012], [17566.0, '青海', 2012], [19507.0, '宁夏', 2012], [17921.0, '新疆', 2012], [44563.9, '北京', 2013], [28979.8, '天津', 2013], [22226.7, '河北', 2013], [22258.2, '山西', 2013], [26003.6, '内蒙古', 2013], [26697.0, '辽宁', 2013], [22274.6, '吉林', 2013], [19597.0, '黑龙江', 2013], [44878.3, '上海', 2013], [31585.5, '江苏', 2013], [37080.0, '浙江', 2013], [22789.3, '安徽', 2013], [28173.9, '福建', 2013], [22119.7, '江西', 2013], [26882.4, '山东', 2013], [21740.7, '河南', 2013], [22906.4, '湖北', 2013], [24352.0, '湖南', 2013], [29537.3, '广东', 2013], [22689.4, '广西', 2013], [22411.4, '海南', 2013], [23058.2, '重庆', 2013], [22227.5, '四川', 2013], [20564.9, '贵州', 2013], [22460.0, '云南', 2013], [20394.5, '西藏', 2013], [22345.9, '陕西', 2013], [19873.0, '甘肃', 2013], [20352.4, '青海', 2013], [21476.0, '宁夏', 2013], [21091.5, '新疆', 2013], [48531.8, '北京', 2014], [31506.0, '天津', 2014], [24141.3, '河北', 2014], [24069.4, '山西', 2014], [28349.6, '内蒙古', 2014], [29081.7, '辽宁', 2014], [23217.82, '吉林', 2014], [22609.0, '黑龙江', 2014], [48841.4, '上海', 2014], [34346.3, '江苏', 2014], [40393.0, '浙江', 2014], [24838.5, '安徽', 2014], [30722.4, '福建', 2014], [24309.2, '江西', 2014], [29221.9, '山东', 2014], [23672.1, '河南', 2014], [24852.3, '湖北', 2014], [26570.2, '湖南', 2014], [32148.1, '广东', 2014], [24669.0, '广西', 2014], [24486.5, '海南', 2014], [25147.2, '重庆', 2014], [24234.4, '四川', 2014], [22548.2, '贵州', 2014], [24299.0, '云南', 2014], [22015.8, '西藏', 2014], [24365.8, '陕西', 2014], [21804.0, '甘肃', 2014], [22306.6, '青海', 2014], [23285.0, '宁夏', 2014], [23214.0, '新疆', 2014], [52859.2, '北京', 2015], [34101.3, '天津', 2015], [26152.16, '河北', 2015], [25827.7, '山西', 2015], [30594.1, '内蒙古', 2015], [31125.7, '辽宁', 2015], [24900.86, '吉林', 2015], [24203.0, '黑龙江', 2015], [52961.9, '上海', 2015], [37173.5, '江苏', 2015], [43714.0, '浙江', 2015], [26936.0, '安徽', 2015], [33275.3, '福建', 2015], [26500.1, '江西', 2015], [31545.3, '山东', 2015], [25575.6, '河南', 2015], [27051.47, '湖北', 2015], [28838.1, '湖南', 2015], [34757.2, '广东', 2015], [26415.9, '广西', 2015], [26356.4, '海南', 2015], [27238.8, '重庆', 2015], [26205.3, '四川', 2015], [24579.6, '贵州', 2015], [26373.2, '云南', 2015], [25456.6, '西藏', 2015], [26420.2, '陕西', 2015], [23767.0, '甘肃', 2015], [24542.3, '青海', 2015], [25186.0, '宁夏', 2015], [26274.7, '新疆', 2015], [57275.0, '北京', 2016], [37109.6, '天津', 2016], [28249.0, '河北', 2016], [27352.3, '山西', 2016], [32974.9, '内蒙古', 2016], [32876.1, '辽宁', 2016], [26530.42, '吉林', 2016], [25736.0, '黑龙江', 2016], [57691.7, '上海', 2016], [40151.6, '江苏', 2016], [47237.0, '浙江', 2016], [29156.0, '安徽', 2016], [36014.3, '福建', 2016], [28673.3, '江西', 2016], [34012.1, '山东', 2016], [27232.9, '河南', 2016], [29385.8, '湖北', 2016], [31283.9, '湖南', 2016], [37684.3, '广东', 2016], [28324.4, '广西', 2016], [28453.5, '海南', 2016], [29610.0, '重庆', 2016], [28335.3, '四川', 2016], [26742.6, '贵州', 2016], [28610.6, '云南', 2016], [27802.4, '西藏', 2016], [28440.0, '陕西', 2016], [25694.0, '甘肃', 2016], [26757.4, '青海', 2016], [27153.0, '宁夏', 2016], [28463.4, '新疆', 2016], [62406.0, '北京', 2017], [40277.5, '天津', 2017], [30548.0, '河北', 2017], [29131.8, '山西', 2017], [35670.0, '内蒙古', 2017], [34993.4, '辽宁', 2017], [28318.75, '吉林', 2017], [27446.0, '黑龙江', 2017], [62595.7, '上海', 2017], [43621.8, '江苏', 2017], [51261.0, '浙江', 2017], [31640.0, '安徽', 2017], [39001.4, '福建', 2017], [31198.1, '江西', 2017], [36789.4, '山东', 2017], [29557.9, '河南', 2017], [31889.4, '湖北', 2017], [33947.9, '湖南', 2017], [40975.1, '广东', 2017], [30502.1, '广西', 2017], [30817.4, '海南', 2017], [32193.2, '重庆', 2017], [30726.9, '四川', 2017], [29079.8, '贵州', 2017], [30995.9, '云南', 2017], [30671.1, '西藏', 2017], [30810.0, '陕西', 2017], [27763.0, '甘肃', 2017], [29168.9, '青海', 2017], [29472.0, '宁夏', 2017], [30774.8, '新疆', 2017], [67990.0, '北京', 2018], [42976.3, '天津', 2018], [32977.2, '河北', 2018], [31034.8, '山西', 2018], [38304.7, '内蒙古', 2018], [37341.9, '辽宁', 2018], [30171.9, '吉林', 2018], [29191.0, '黑龙江', 2018], [68033.6, '上海', 2018], [47200.0, '江苏', 2018], [55574.3, '浙江', 2018], [34393.1, '安徽', 2018], [42121.3, '福建', 2018], [33819.4, '江西', 2018], [39549.4, '山东', 2018], [31874.2, '河南', 2018], [34454.6, '湖北', 2018], [33349.0, '湖南', 2018], [44341.0, '广东', 2018], [32436.1, '广西', 2018], [33348.7, '海南', 2018], [34889.3, '重庆', 2018], [33215.9, '四川', 2018], [31591.9, '贵州', 2018], [33487.9, '云南', 2018], [33797.4, '西藏', 2018], [33319.0, '陕西', 2018], [29957.0, '甘肃', 2018], [31514.5, '青海', 2018], [31895.2, '宁夏', 2018], [32763.5, '新疆', 2018], [73849.0, '北京', 2019], [46118.9, '天津', 2019], [35737.7, '河北', 2019], [33262.4, '山西', 2019], [40782.5, '内蒙古', 2019], [39777.2, '辽宁', 2019], [32299.2, '吉林', 2019], [30945.0, '黑龙江', 2019], [73615.3, '上海', 2019], [51056.1, '江苏', 2019], [60182.3, '浙江', 2019], [37540.0, '安徽', 2019], [45620.5, '福建', 2019], [36545.9, '江西', 2019], [42329.2, '山东', 2019], [34201.0, '河南', 2019], [37601.4, '湖北', 2019], [36017.0, '湖南', 2019], [48117.6, '广东', 2019], [34744.9, '广西', 2019], [36016.7, '海南', 2019], [37938.6, '重庆', 2019], [36153.7, '四川', 2019], [34404.2, '贵州', 2019], [36237.7, '云南', 2019], [37410.0, '西藏', 2019], [36098.0, '陕西', 2019], [32323.4, '甘肃', 2019], [33830.3, '青海', 2019], [34328.5, '宁夏', 2019], [34663.7, '新疆', 2019], [75602.0, '北京', 2020], [47659.0, '天津', 2020], [37286.0, '河北', 2020], [34793.0, '山西', 2020], [41353.0, '内蒙古', 2020], [40376.0, '辽宁', 2020], [33396.0, '吉林', 2020], [31115.0, '黑龙江', 2020], [76437.0, '上海', 2020], [53102.0, '江苏', 2020], [62699.0, '浙江', 2020], [39442.0, '安徽', 2020], [47160.0, '福建', 2020], [38556.0, '江西', 2020], [43726.0, '山东', 2020], [34750.0, '河南', 2020], [36706.0, '湖北', 2020], [41698.0, '湖南', 2020], [50257.0, '广东', 2020], [35859.0, '广西', 2020], [37097.0, '海南', 2020], [40006.0, '重庆', 2020], [38253.0, '四川', 2020], [36096.0, '贵州', 2020], [37500.0, '云南', 2020], [41156.0, '西藏', 2020], [37868.0, '陕西', 2020], [33822.0, '甘肃', 2020], [35506.0, '青海', 2020], [35720.0, '宁夏', 2020], [34838.0, '新疆', 2020]]
run(data)
function run(_rawData) {
  const countries = [
    '北京',
    '天津',
    '河北',
    '山西',
    '内蒙古',
    '辽宁',
    '吉林',
    '黑龙江',
    '上海',
    '江苏',
    '浙江',
    '安徽',
    '福建',
    '江西',
    '山东',
    '河南',
    '湖北',
    '湖南',
    '广东',
    '广西',
    '海南',
    '重庆',
    '四川',
    '贵州',
    '云南',
    '西藏',
    '陕西',
    '甘肃',
    '青海',
    '宁夏',
    '新疆',
  ];
  const datasetWithFilters = [];
  const seriesList = [];
  echarts.util.each(countries, function (country) {
    var datasetId = 'dataset_' + country;
    datasetWithFilters.push({
      id: datasetId,
      fromDatasetId: 'dataset_raw',
      transform: {
        type: 'filter',
        config: {
          and: [
            { dimension: 'Year', gte: 2003 },
            { dimension: 'Country', '=': country }
          ]
        }
      }
    });
    seriesList.push({
      type: 'line',
      datasetId: datasetId,
      showSymbol: false,
      name: country,
      endLabel: {
        show: true,
        formatter: function (params) {
          return params.value[1] + ': ' + params.value[0];
        }
      },
      labelLayout: {
        moveOverlap: 'shiftY'
      },
      emphasis: {
        focus: 'series'
      },
      encode: {
        x: 'Year',
        y: 'Income',
        label: ['Country', 'Income'],
        itemName: 'Year',
        tooltip: ['Income']
      }
    });
  });
  incomeOption = {
    animationDuration: 8000,
    dataset: [
      {
        id: 'dataset_raw',
        source: _rawData
      },
      ...datasetWithFilters
    ],
    title: {
      text: '2003年-2020年全国各省市城镇居民人均可支配收入变化',
      subtext: '数据来源：国家统计局',
      left: 'center'
    },
    tooltip: {
      order: 'valueDesc',
      trigger: 'axis'
    },
    xAxis: {
      type: 'category',
      nameLocation: 'middle'
    },
    yAxis: {
      name: 'Income'
    },
    grid: {
      right: 140
    },
    series: seriesList,
    universalTransition: true
  };
  setInterval(function() {
    console.log('bb')
    income.clear()
    income.setOption(incomeOption, {
      notMerge: true
    });
  }, 15000)
}

incomeOption && income.setOption(incomeOption);

// 铁路里程
var ROOT_PATH =
  'https://fastly.jsdelivr.net/gh/apache/echarts-website@asf-site/examples';

var railwayDOM = document.getElementById('railway');
var railway = echarts.init(railwayDOM, theme='dark');
var railwayOption;

railway.showLoading();
$.get('https://geo.datav.aliyun.com/areas_v3/bound/100000_full.json', function (chinajson) {
  railway.hideLoading();
  echarts.registerMap('china', chinajson);
  var data = [{name: '天津市', value: 970.93}, {name: '北京市', value: 1284.75}, {name: '上海市', value: 465.01}, {name: '辽宁省', value: 5129.57}, {name: '河北省', value: 6252.77}, {name: '山东省', value: 5028.92}, {name: '山西省', value: 4979.52}, {name: '河南省', value: 5199.76}, {name: '江苏省', value: 2677.95}, {name: '安徽省', value: 3548.44}, {name: '吉林省', value: 4520.49}, {name: '浙江省', value: 2347.16}, {name: '福建省', value: 2759.13}, {name: '广东省', value: 4026.98}, {name: '江西省', value: 3702.27}, {name: '陕西省', value: 4524.12}, {name: '湖北省', value: 4059.31}, {name: '重庆市', value: 1781.24}, {name: '湖南省', value: 4550.47}, {name: '海南省', value: 693.73}, {name: '广西壮族自治区', value: 4741.53}, {name: '宁夏回族自治区', value: 1289.47}, {name: '贵州省', value: 2373.1}, {name: '黑龙江省', value: 6019.33}, {name: '内蒙古自治区', value: 10226.01}, {name: '四川省', value: 3976.01}, {name: '云南省', value: 2915.91}, {name: '甘肃省', value: 3403.44}, {name: '新疆维吾尔自治区', value: 5462.83}, {name: '青海省', value: 2124.6}, {name: '西藏自治区', value: 786.35}]
  var data2 = [{'name': '天津省', 'value': 859.2}, {'name': '北京省', 'value': 764.7}, {'name': '上海省', 'value': 738.1}, {'name': '辽宁省', 'value': 351.6}, {'name': '河北省', 'value': 333.1}, {'name': '山东省', 'value': 327.0}, {'name': '山西省', 'value': 318.6}, {'name': '河南省', 'value': 311.4}, {'name': '江苏省', 'value': 261.0}, {'name': '安徽省', 'value': 254.0}, {'name': '吉林省', 'value': 241.2}, {'name': '浙江省', 'value': 230.1}, {'name': '福建省', 'value': 227.5}, {'name': '广东省', 'value': 223.7}, {'name': '江西省', 'value': 221.7}, {'name': '陕西省', 'value': 220.0}, {'name': '湖北省', 'value': 218.4}, {'name': '重庆省', 'value': 216.4}, {'name': '湖南省', 'value': 214.8}, {'name': '海南省', 'value': 204.0}, {'name': '广西省', 'value': 200.9}, {'name': '宁夏省', 'value': 194.2}, {'name': '贵州省', 'value': 134.8}, {'name': '黑龙江省', 'value': 132.4}, {'name': '内蒙古省', 'value': 86.4}, {'name': '四川省', 'value': 82.6}, {'name': '云南省', 'value': 76.1}, {'name': '甘肃省', 'value': 74.9}, {'name': '新疆省', 'value': 32.9}, {'name': '青海省', 'value': 29.4}, {'name': '西藏省', 'value': 6.4}]

  data.sort(function (a, b) {
    return a.value - b.value;
  });
  const mapOption = {
    title: {
      top: 0,
      left: 'center',
      text: '2014年全国各省市铁路里程图（不含台湾省）',
      subtext: '数据来源：皮书数据库'
    },  
    backgroundColor: 'transparent',
    visualMap: {
      left: 'right',
      min: 500,
      max: 10000,
      // inRange: {
      //   color: ['#313695', '#4575b4', '#74add1', '#abd9e9', '#e0f3f8', '#ffffbf', '#fee090', '#fdae61', '#f46d43', '#d73027', '#a50026']
      // },
      text: ['High', 'Low'],
      calculable: true
    },
    series: [
      {
        id: 'population',
        type: 'map',
        roam: true,
        center: [105, 37],
        zoom: 1.5,
        map: 'china',
        animationDurationUpdate: 1000,
        universalTransition: true,
        data: data
      }
    ]
  };
  const barOption = {
    title: {
      top: 0,
      left: 'center',
      text: '2014年全国各省市铁路密度分布图（不含台湾省）',
      subtext: '数据来源：皮书数据库'
    },  
    backgroundColor: 'transparent',
    xAxis: {
      type: 'value'
    },
    yAxis: {
      type: 'category',
      axisLabel: {
        rotate: 30
      },
      axisLabel: {
        //x轴文字的配置
        show: true,
        interval: 0,//使x轴文字显示全
       },  
      data: data2.map(function (item) {
        return item.name;
      })
    },
    animationDurationUpdate: 1000,
    series: {
      type: 'bar',
      id: 'population',
      colorBy: data,
      data: data2.map(function (item) {
        return item.value;
      }),
      universalTransition: true
    }
  };
  let currentOption = mapOption;
  railway.setOption(mapOption);
  setInterval(function () {
    currentOption = currentOption === mapOption ? barOption : mapOption;
    railway.setOption(currentOption, true);
  }, 4000);
});

railwayOption && railway.setOption(railwayOption);

// 转移支付数据
var payDOM = document.getElementById('pay');
var pay = echarts.init(payDOM, theme='dark');
var payOption;
var paydata = [[2016, '四川', 3984], [2016, '河南', 3672], [2016, '湖南', 3070], [2016, '湖北', 2773], [2016, '云南', '266Z'], [2016, '黑龙江', 2775], [2016, '河北', 2619], [2016, '安徽', 2548], [2016, '新疆', 2407], [2016, '贵州', 2552], [2016, '广西', 2391], [2016, '山东', 2318], [2016, '内蒙古', 2347], [2016, '江西', 2102], [2016, '甘肃', 2012], [2016, '陕西', 2090], [2016, '辽宁', 2029], [2016, '吉林', 1882], [2016, '山西', 1486], [2016, '重庆', 1508], [2016, '西藏', 1400], [2016, '江苏', 1410], [2016, '广东', 1358], [2016, '福建', 1131], [2016, '青海', 1063], [2016, '浙江', 870], [2016, '北京', 691], [2016, '宁夏', 729], [2016, '海南', 636], [2016, '上海', 477], [2016, '天津', 489], [2017, '四川', 4346], [2017, '河南', 3970], [2017, '湖南', 3262], [2017, '湖北', 2932], [2017, '云南', 3032], [2017, '黑龙江', 2997], [2017, '河北', 2902], [2017, '安徽', 2885], [2017, '新疆', 2639], [2017, '贵州', 2758], [2017, '广西', 2626], [2017, '山东', 2545], [2017, '内蒙古', 2529], [2017, '江西', 2315], [2017, '甘肃', 2182], [2017, '陕西', 2253], [2017, '辽宁', 2252], [2017, '吉林', 2066], [2017, '山西', 1665], [2017, '重庆', 1713], [2017, '西藏', 1482], [2017, '江苏', 1563], [2017, '广东', 1494], [2017, '福建', 1240], [2017, '青海', 1122], [2017, '浙江', 977], [2017, '北京', 826], [2017, '宁夏', 816], [2017, '海南', 698], [2017, '上海', 583], [2017, '天津', 550], [2018, '四川', 4780], [2018, '河南', 4253], [2018, '湖南', 3470], [2018, '湖北', 3111], [2018, '云南', 3213], [2018, '黑龙江', 3052], [2018, '河北', 3065], [2018, '安徽', 3053], [2018, '新疆', 2886], [2018, '贵州', 2922], [2018, '广西', 2833], [2018, '山东', 2788], [2018, '内蒙古', 2603], [2018, '江西', 2432], [2018, '甘肃', 2458], [2018, '陕西', 2453], [2018, '辽宁', 2395], [2018, '吉林', 2117], [2018, '山西', 1771], [2018, '重庆', 1771], [2018, '西藏', 1760], [2018, '江苏', 1579], [2018, '广东', 1574], [2018, '福建', 1243], [2018, '青海', 1226], [2018, '浙江', 1030], [2018, '北京', 949], [2018, '宁夏', 859], [2018, '海南', 815], [2018, '上海', 663], [2018, '天津', 551], [2019, '四川', 5122], [2019, '河南', 4498], [2019, '湖南', 3657], [2019, '湖北', 3369], [2019, '云南', 3829], [2019, '黑龙江', 3312], [2019, '河北', 3357], [2019, '安徽', 3284], [2019, '新疆', 3240], [2019, '贵州', 3041], [2019, '广西', 3082], [2019, '山东', 2717], [2019, '内蒙古', 2641], [2019, '江西', 2706], [2019, '甘肃', 2685], [2019, '陕西', 2595], [2019, '辽宁', 2503], [2019, '吉林', 2303], [2019, '山西', 1909], [2019, '重庆', 1853], [2019, '西藏', 1984], [2019, '江苏', 1597], [2019, '广东', 1456], [2019, '福建', 1349], [2019, '青海', 1361], [2019, '浙江', 966], [2019, '北京', 1003], [2019, '宁夏', 208], [2019, '海南', 919], [2019, '上海', 627], [2019, '天津', 543], [2020, '四川', 5708], [2020, '河南', 5067], [2020, '湖南', 4111], [2020, '湖北', 4784], [2020, '云南', 4168], [2020, '黑龙江', 3874], [2020, '河北', 3941], [2020, '安徽', 3639], [2020, '新疆', 3469], [2020, '贵州', 3166], [2020, '广西', 3382], [2020, '山东', 3030], [2020, '内蒙古', 2759], [2020, '江西', 2967], [2020, '甘肃', 2939], [2020, '陕西', 2871], [2020, '辽宁', 2914], [2020, '吉林', 2461], [2020, '山西', 2231], [2020, '重庆', 2081], [2020, '西藏', 1978], [2020, '江苏', 1809], [2020, '广东', 1685], [2020, '福建', 1476], [2020, '青海', 1442], [2020, '浙江', 874], [2020, '北京', 1056], [2020, '宁夏', 971], [2020, '海南', 1020], [2020, '上海', 830], [2020, '天津', 613]]
var years = [2016,2017,2018,2019,2020];
var startIndex = 0;
var startYear = years[startIndex];
var updateFrequency = 3000;
payOption = {
  title: {
      text: '2016年至2020年各省转移支付金额排序',
      subtext: '数据来源：各省市统计局',
      left: 'center',
      top: 0
  },
  backgroundColor: 'transparent',
  grid: {
      top: '10%',
      width: 'auto',
      height: 'auto'
  },
  xAxis: {
      labelLable: {
          formatter: function (n) {
              return Math.round(n);
          }
      }
  },
  dataset: {
      source: paydata.filter(function (d) {
          return d[0] === startYear;
      })
  },
  yAxis: {
      type: 'category',
      inverse: true,
      max: 20,
      axisLabel: {
          show: true,
          textStyle: {
              fontSize: 14
          },
      interval: 0,//使x轴文字显示全
    },
      animationDuration: 300,
      animationDurationUpdate: 300
  },
  series: [{
      realtimeSort: true,
      seriesLayoutBy: 'column',
      type: 'bar',
      color: '#00ffd7',
      // itemStyle: {
      //     color: function (param) {
      //         return countryColors[param.value[1]] || '#5470c6';
      //     }
      // },
      encode: {
          x: 2,
          y: 1
      },
      label: {
          show: true,
          precision: 1,
          position: 'right',
          valueAnimation: true,
          fontFamily: 'monospace'
      }
  }],
  // Disable init animation.
  animationDuration: 2,
  animationDurationUpdate: updateFrequency,
  animationEasing: 'linear',
  animationEasingUpdate: 'linear',
  graphic: {
      elements: [{
          type: 'text',
          right: 130,
          bottom: 60,
          style: {
              text: startYear,
              font: 'bolder 80px monospace',
              fill: 'rgba(100, 100, 100, 0.25)'
          },
          z: 100
      }]
    }
};
if (payOption && typeof payOption === 'object') {
  pay.setOption(payOption);
}
for (var i = startIndex; i < years.length - 1; ++i) {
  (function (i) {
      if (i < years.length) {
          setTimeout(function () {
              updateYear(years[i + 1]);
          }, (i - startIndex) * updateFrequency);
      } else {
          i = 0
      }
  })(i);
}
setInterval(function() {
  for (var i = startIndex; i < years.length - 1; i++) {
    (function (i) {
        if (0 < i < years.length) {
            setTimeout(function () {
                updateYear(years[i + 1]);
            }, (i - startIndex) * updateFrequency);
        } else if (i == 0)  {
            updateYear(years[0]);
        } else {
            i = 0
        }
    })(i);
  }
  pay.clear()
}, 15000)
function updateYear(year) {
    var source = paydata.filter(function (d) {
        return d[0] === year;
    });
    payOption.series[0].data = source;
    payOption.graphic.elements[0].style.text = year;
    pay.setOption(payOption);
}

// 土地财政
var tudiDOM = document.getElementById('tudi');
var tudi = echarts.init(tudiDOM, theme='dark');
var tudiOption;
tudiOption = {
  tooltip: {
    trigger: 'axis',
    axisPointer: {
      type: 'cross',
      crossStyle: {
        color: '#999'
      }
    }
  },
  backgroundColor: 'transparent',
  toolbox: {
    feature: {
      // dataView: { show: true, readOnly: false },
      // magicType: { show: true, type: ['line', 'bar'] },
      restore: { show: true },
      saveAsImage: { show: true }
    }
  },
  title: {
    text: '2020年中国主要城市土地财政依赖度',
    subtext: '数据来源',
    top: 0,
    left: 'center'
  },
  legend: {
    data: ['土地出让收入', '一般公共预算收入', '土地财政依赖度'],
    bottom: 0,
    left: 'center'
  },
  xAxis: [
    {
      type: 'category',
      data: [
        '长春',
        '广州',
        '武汉',
        '西安',
        '南京',
        '杭州',
        '哈尔滨',
        '宁波',
        '成都',
        '厦门',
        '沈阳',
        '济南',
        '青岛',
        '重庆',
        '天津',
        '大连',
        '上海',
        '北京',
        '深圳',
        ],
      axisPointer: {
        type: 'shadow'
      },
      axisLabel: {
        //x轴文字的配置
        show: true,
        interval: 0,//使x轴文字显示全
       }

    }
  ],
  yAxis: [
    {
      type: 'value',
      name: '金额',
      axisLabel: {
        formatter: '{value} 亿元'
      }
    },
    {
      type: 'value',
      name: '土地财政依赖度',
      axisLabel: {
        formatter: '{value} %'
      }
    }
  ],
  series: [
    {
      name: '土地出让收入',
      type: 'bar',
      tooltip: {
        valueFormatter: function (value) {
          return value + ' 亿元';
        }
      },
      colorBy: 'series',
      data: [
        683,
        2564,
        1840,
        1058,
        2094,
        2574,
        324,
        1366,
        1311,
        637,
        586,
        680,
        757,
        1255,
        1017,
        327,
        2952,
        1957,
        1054,
      ]
    },
    {
      name: '一般公共预算收入',
      type: 'bar',
      tooltip: {
        valueFormatter: function (value) {
          return value + ' 亿元';
        }
      },
      colorBy: 'series', 
      data: [
        440.4,
        1714,
        1230.3,
        724.1,
        1637.7,
        2093.4,
        339.6,
        1510.8,
        1520.4,
        783.9,
        736.1,
        906.1,
        1253.8,
        2095,
        1923.1,
        702.7,
        7046.3,
        5483.9,
        3857,
      ]
    },
    {
      name: '土地财政依赖度',
      type: 'line',
      yAxisIndex: 1,
      markLine: {
        data: [{
          name: '基准线',
          yAxis: 100
        }] ,
        label: {
          show: true
        },
        silent: true,
        animation: true
      },
      tooltip: {
        valueFormatter: function (value) {
          return value + ' %';
        }
      },
      data: [
        155.09,
        149.59,
        149.56,
        146.11,
        127.86,
        122.96,
        95.41,
        90.42,
        86.23,
        81.26,
        79.61,
        75.05,
        60.38,
        59.9,
        52.88,
        46.53,
        41.89,
        35.69,
        27.33,
        ]
    }
  ]
};

tudiOption && tudi.setOption(tudiOption);

// 一般公共支出占比
var zcDOM = document.getElementById('zhichu');
var zhichu = echarts.init(zcDOM, theme='dark');

let zhichuOption = {
  title: {
    text: '2007年至2020年东北三省政府一般公共服务支出占财政支出比例变化图',
    subtext: '数据来源：',
    top: 0,
    left: 'center'
  },
  backgroundColor: 'transparent',
  tooltip: {
    trigger: 'axis'
  },
  legend: {
    data: ['黑龙江', '吉林', '辽宁', '全国'],
    bottom: 0,
    left: 'center'
  },
  grid: {
    left: '3%',
    right: '4%',
    bottom: '10%',
    containLabel: true
  },
  toolbox: {
    feature: {
      saveAsImage: {}
    }
  },
  xAxis: {
    type: 'category',
    boundaryGap: false,
    data: generateArray(2007, 2020)
  },
  yAxis: {
    type: 'value'
  },
  series: [
    {
      name: '黑龙江',
      type: 'line',
      stack: 'Total',
      data: [0.316688015,0.341332724,0.275836007,0.200005553,0.194165272,0.186523606,0.171331939,0.156131102,0.125322123,0.128042633,0.122746384,0.136714147,0.121418692,0.129857417,]
    },
    {
      name: '吉林',
      type: 'line',
      stack: 'Total',
      data: [0.349652423,0.321476902,0.259333561,0.233146944,0.219043742,0.220273017,0.205466495,0.17843811,0.15954061,0.145267975,0.155056792,0.165744382,0.154873821,0.162906201]
    },
    {
      name: '辽宁',
      type: 'line',
      stack: 'Total',
      data: [0.350353186,0.328293388,0.26285246,0.240138883,0.235841716,0.226615683,0.198459752,0.176285835,0.175707245,0.195031154,0.196485424,0.203432591,0.196622748,0.198699673,]
    },
    {
      name: '全国',
      type: 'line',
      stack: 'Total',
      data: [0.344811202,0.322975289,0.267579978,0.245478697,0.229616437,0.231864436,0.22175196,0.199359372,0.174681246,0.178477637,0.18427088,0.186961534,0.186017368,0.193549726,]
    },
  ]
};
zhichuOption && zhichu.setOption(zhichuOption);

// 上市公司排名
var companyDOM = document.getElementById('company');
var company = echarts.init(companyDOM);
var companyOption;

companyOption = {
  title: {
    text: '我国各省市A股上市公司数量（不含港澳台及海外地区）',
    subtext: '数据来源：A股公报',
    left: 'center',
    top: 0
  },
  tooltip: {
    trigger: 'item',
    formatter: '{b}: {c} ({d}%)'
  },
  toolbox: {
    feature: {
      saveAsImage: {}
    }
  },
  // legend: {
  //   data: [
  //     '安徽省',
  //     '北京市',
  //     '福建省',
  //     '甘肃省',
  //     '广东省',
  //     '广西壮族自治区',
  //     '贵州省',
  //     '海南省',
  //     '河北省',
  //     '河南省',
  //     '黑龙江省',
  //     '湖北省',
  //     '湖南省',
  //     '吉林省',
  //     '江苏省',
  //     '江西省',
  //     '辽宁省',
  //     '内蒙古自治区',
  //     '宁夏回族自治区',
  //     '青海省',
  //     '山东省',
  //     '山西省',
  //     '陕西省',
  //     '上海市',
  //     '四川省',
  //     '天津市',
  //     '西藏自治区',
  //     '新疆维吾尔自治区',
  //     '云南省',
  //     '浙江省',
  //     '重庆市',
  //   ]
  // },
  series: [
    {
      type: 'pie',
      selectedMode: 'single',
      radius: [0, '30%'],
      label: {
        position: 'inner',
        fontSize: 14
      },
      top: '10%',
      labelLine: {
        show: false
      },
      data: [
        { value: 205, name: '东北三省', selected: true },
        { value: 4860, name: '其它省份',  },
      ]
    },
    {
      type: 'pie',
      radius: ['45%', '60%'],
      labelLine: {
        length: 30
      },
      top: '10%',
      label: {
        formatter: '  {b|{b}：}{c}  {per|{d}%}  ',
        backgroundColor: '#F6F8FC',
        borderColor: '#8C8D8E',
        borderWidth: 1,
        borderRadius: 4,
        rich: {
          a: {
            color: '#6E7079',
            lineHeight: 22,
            align: 'center'
          },
          hr: {
            borderColor: '#8C8D8E',
            width: '100%',
            borderWidth: 1,
            height: 0
          },
          b: {
            color: '#4C5058',
            fontSize: 14,
            fontWeight: 'bold',
            lineHeight: 33
          },
          per: {
            color: '#fff',
            backgroundColor: '#4C5058',
            padding: [3, 4],
            borderRadius: 4
          }
        }
      },
      data: [
        { value: 156, name: '安徽省'},
        { value: 443, name: '北京市'},
        { value: 172, name: '福建省'},
        { value: 38, name: '甘肃省'},
        { value: 839, name: '广东省'},
        { value: 40, name: '广西壮族自治区'},
        { value: 35, name: '贵州省'},
        { value: 40, name: '海南省'},
        { value: 74, name: '河北省'},
        { value: 103, name: '河南省'},
        { value: 46, name: '黑龙江省'},
        { value: 143, name: '湖北省'},
        { value: 142, name: '湖南省'},
        { value: 58, name: '吉林省'},
        { value: 611, name: '江苏省'},
        { value: 70, name: '江西省'},
        { value: 101, name: '辽宁省'},
        { value: 31, name: '内蒙古自治区'},
        { value: 16, name: '宁夏回族自治区'},
        { value: 12, name: '青海省'},
        { value: 284, name: '山东省'},
        { value: 42, name: '山西省'},
        { value: 72, name: '陕西省'},
        { value: 444, name: '上海市'},
        { value: 170, name: '四川省'},
        { value: 67, name: '天津市'},
        { value: 21, name: '西藏自治区'},
        { value: 59, name: '新疆维吾尔自治区'},
        { value: 43, name: '云南省'},
        { value: 626, name: '浙江省'},
        { value: 67, name: '重庆市'},
      ]
    }
  ]
};
companyOption && company.setOption(companyOption);


// 国企比例
var gqPercentageDOM = document.getElementById('guoqiPercentage');
var gqPercentage = echarts.init(gqPercentageDOM);
var gqPercentageOption;

const pathSymbols = {
  reindeer:
    'path://M-22.788,24.521c2.08-0.986,3.611-3.905,4.984-5.892 c-2.686,2.782-5.047,5.884-9.102,7.312c-0.992,0.005-0.25-2.016,0.34-2.362l1.852-0.41c0.564-0.218,0.785-0.842,0.902-1.347 c2.133-0.727,4.91-4.129,6.031-6.194c1.748-0.7,4.443-0.679,5.734-2.293c1.176-1.468,0.393-3.992,1.215-6.557 c0.24-0.754,0.574-1.581,1.008-2.293c-0.611,0.011-1.348-0.061-1.959-0.608c-1.391-1.245-0.785-2.086-1.297-3.313 c1.684,0.744,2.5,2.584,4.426,2.586C-8.46,3.012-8.255,2.901-8.04,2.824c6.031-1.952,15.182-0.165,19.498-3.937 c1.15-3.933-1.24-9.846-1.229-9.938c0.008-0.062-1.314-0.004-1.803-0.258c-1.119-0.771-6.531-3.75-0.17-3.33 c0.314-0.045,0.943,0.259,1.439,0.435c-0.289-1.694-0.92-0.144-3.311-1.946c0,0-1.1-0.855-1.764-1.98 c-0.836-1.09-2.01-2.825-2.992-4.031c-1.523-2.476,1.367,0.709,1.816,1.108c1.768,1.704,1.844,3.281,3.232,3.983 c0.195,0.203,1.453,0.164,0.926-0.468c-0.525-0.632-1.367-1.278-1.775-2.341c-0.293-0.703-1.311-2.326-1.566-2.711 c-0.256-0.384-0.959-1.718-1.67-2.351c-1.047-1.187-0.268-0.902,0.521-0.07c0.789,0.834,1.537,1.821,1.672,2.023 c0.135,0.203,1.584,2.521,1.725,2.387c0.102-0.259-0.035-0.428-0.158-0.852c-0.125-0.423-0.912-2.032-0.961-2.083 c-0.357-0.852-0.566-1.908-0.598-3.333c0.4-2.375,0.648-2.486,0.549-0.705c0.014,1.143,0.031,2.215,0.602,3.247 c0.807,1.496,1.764,4.064,1.836,4.474c0.561,3.176,2.904,1.749,2.281-0.126c-0.068-0.446-0.109-2.014-0.287-2.862 c-0.18-0.849-0.219-1.688-0.113-3.056c0.066-1.389,0.232-2.055,0.277-2.299c0.285-1.023,0.4-1.088,0.408,0.135 c-0.059,0.399-0.131,1.687-0.125,2.655c0.064,0.642-0.043,1.768,0.172,2.486c0.654,1.928-0.027,3.496,1,3.514 c1.805-0.424,2.428-1.218,2.428-2.346c-0.086-0.704-0.121-0.843-0.031-1.193c0.221-0.568,0.359-0.67,0.312-0.076 c-0.055,0.287,0.031,0.533,0.082,0.794c0.264,1.197,0.912,0.114,1.283-0.782c0.15-0.238,0.539-2.154,0.545-2.522 c-0.023-0.617,0.285-0.645,0.309,0.01c0.064,0.422-0.248,2.646-0.205,2.334c-0.338,1.24-1.105,3.402-3.379,4.712 c-0.389,0.12-1.186,1.286-3.328,2.178c0,0,1.729,0.321,3.156,0.246c1.102-0.19,3.707-0.027,4.654,0.269 c1.752,0.494,1.531-0.053,4.084,0.164c2.26-0.4,2.154,2.391-1.496,3.68c-2.549,1.405-3.107,1.475-2.293,2.984 c3.484,7.906,2.865,13.183,2.193,16.466c2.41,0.271,5.732-0.62,7.301,0.725c0.506,0.333,0.648,1.866-0.457,2.86 c-4.105,2.745-9.283,7.022-13.904,7.662c-0.977-0.194,0.156-2.025,0.803-2.247l1.898-0.03c0.596-0.101,0.936-0.669,1.152-1.139 c3.16-0.404,5.045-3.775,8.246-4.818c-4.035-0.718-9.588,3.981-12.162,1.051c-5.043,1.423-11.449,1.84-15.895,1.111 c-3.105,2.687-7.934,4.021-12.115,5.866c-3.271,3.511-5.188,8.086-9.967,10.414c-0.986,0.119-0.48-1.974,0.066-2.385l1.795-0.618 C-22.995,25.682-22.849,25.035-22.788,24.521z',
  plane:
    'path://M1.112,32.559l2.998,1.205l-2.882,2.268l-2.215-0.012L1.112,32.559z M37.803,23.96 c0.158-0.838,0.5-1.509,0.961-1.904c-0.096-0.037-0.205-0.071-0.344-0.071c-0.777-0.005-2.068-0.009-3.047-0.009 c-0.633,0-1.217,0.066-1.754,0.18l2.199,1.804H37.803z M39.738,23.036c-0.111,0-0.377,0.325-0.537,0.924h1.076 C40.115,23.361,39.854,23.036,39.738,23.036z M39.934,39.867c-0.166,0-0.674,0.705-0.674,1.986s0.506,1.986,0.674,1.986 s0.672-0.705,0.672-1.986S40.102,39.867,39.934,39.867z M38.963,38.889c-0.098-0.038-0.209-0.07-0.348-0.073 c-0.082,0-0.174,0-0.268-0.001l-7.127,4.671c0.879,0.821,2.42,1.417,4.348,1.417c0.979,0,2.27-0.006,3.047-0.01 c0.139,0,0.25-0.034,0.348-0.072c-0.646-0.555-1.07-1.643-1.07-2.967C37.891,40.529,38.316,39.441,38.963,38.889z M32.713,23.96 l-12.37-10.116l-4.693-0.004c0,0,4,8.222,4.827,10.121H32.713z M59.311,32.374c-0.248,2.104-5.305,3.172-8.018,3.172H39.629 l-25.325,16.61L9.607,52.16c0,0,6.687-8.479,7.95-10.207c1.17-1.6,3.019-3.699,3.027-6.407h-2.138 c-5.839,0-13.816-3.789-18.472-5.583c-2.818-1.085-2.396-4.04-0.031-4.04h0.039l-3.299-11.371h3.617c0,0,4.352,5.696,5.846,7.5 c2,2.416,4.503,3.678,8.228,3.87h30.727c2.17,0,4.311,0.417,6.252,1.046c3.49,1.175,5.863,2.7,7.199,4.027 C59.145,31.584,59.352,32.025,59.311,32.374z M22.069,30.408c0-0.815-0.661-1.475-1.469-1.475c-0.812,0-1.471,0.66-1.471,1.475 s0.658,1.475,1.471,1.475C21.408,31.883,22.069,31.224,22.069,30.408z M27.06,30.408c0-0.815-0.656-1.478-1.466-1.478 c-0.812,0-1.471,0.662-1.471,1.478s0.658,1.477,1.471,1.477C26.404,31.885,27.06,31.224,27.06,30.408z M32.055,30.408 c0-0.815-0.66-1.475-1.469-1.475c-0.808,0-1.466,0.66-1.466,1.475s0.658,1.475,1.466,1.475 C31.398,31.883,32.055,31.224,32.055,30.408z M37.049,30.408c0-0.815-0.658-1.478-1.467-1.478c-0.812,0-1.469,0.662-1.469,1.478 s0.656,1.477,1.469,1.477C36.389,31.885,37.049,31.224,37.049,30.408z M42.039,30.408c0-0.815-0.656-1.478-1.465-1.478 c-0.811,0-1.469,0.662-1.469,1.478s0.658,1.477,1.469,1.477C41.383,31.885,42.039,31.224,42.039,30.408z M55.479,30.565 c-0.701-0.436-1.568-0.896-2.627-1.347c-0.613,0.289-1.551,0.476-2.73,0.476c-1.527,0-1.639,2.263,0.164,2.316 C52.389,32.074,54.627,31.373,55.479,30.565z',
  train:
    'path://M67.335,33.596L67.335,33.596c-0.002-1.39-1.153-3.183-3.328-4.218h-9.096v-2.07h5.371 c-4.939-2.07-11.199-4.141-14.89-4.141H19.72v12.421v5.176h38.373c4.033,0,8.457-1.035,9.142-5.176h-0.027 c0.076-0.367,0.129-0.751,0.129-1.165L67.335,33.596L67.335,33.596z M27.999,30.413h-3.105v-4.141h3.105V30.413z M35.245,30.413 h-3.104v-4.141h3.104V30.413z M42.491,30.413h-3.104v-4.141h3.104V30.413z M49.736,30.413h-3.104v-4.141h3.104V30.413z  M14.544,40.764c1.143,0,2.07-0.927,2.07-2.07V35.59V25.237c0-1.145-0.928-2.07-2.07-2.07H-9.265c-1.143,0-2.068,0.926-2.068,2.07 v10.351v3.105c0,1.144,0.926,2.07,2.068,2.07H14.544L14.544,40.764z M8.333,26.272h3.105v4.141H8.333V26.272z M1.087,26.272h3.105 v4.141H1.087V26.272z M-6.159,26.272h3.105v4.141h-3.105V26.272z M-9.265,41.798h69.352v1.035H-9.265V41.798z',
  ship: 'path://M16.678,17.086h9.854l-2.703,5.912c5.596,2.428,11.155,5.575,16.711,8.607c3.387,1.847,6.967,3.75,10.541,5.375 v-6.16l-4.197-2.763v-5.318L33.064,12.197h-11.48L20.43,15.24h-4.533l-1.266,3.286l0.781,0.345L16.678,17.086z M49.6,31.84 l0.047,1.273L27.438,20.998l0.799-1.734L49.6,31.84z M33.031,15.1l12.889,8.82l0.027,0.769L32.551,16.1L33.031,15.1z M22.377,14.045 h9.846l-1.539,3.365l-2.287-1.498h1.371l0.721-1.352h-2.023l-0.553,1.037l-0.541-0.357h-0.34l0.359-0.684h-2.025l-0.361,0.684 h-3.473L22.377,14.045z M23.695,20.678l-0.004,0.004h0.004V20.678z M24.828,18.199h-2.031l-0.719,1.358h2.029L24.828,18.199z  M40.385,34.227c-12.85-7.009-25.729-14.667-38.971-12.527c1.26,8.809,9.08,16.201,8.213,24.328 c-0.553,4.062-3.111,0.828-3.303,7.137c15.799,0,32.379,0,48.166,0l0.066-4.195l1.477-7.23 C50.842,39.812,45.393,36.961,40.385,34.227z M13.99,35.954c-1.213,0-2.195-1.353-2.195-3.035c0-1.665,0.98-3.017,2.195-3.017 c1.219,0,2.195,1.352,2.195,3.017C16.186,34.604,15.213,35.954,13.99,35.954z M23.691,20.682h-2.02l-0.588,1.351h2.023 L23.691,20.682z M19.697,18.199l-0.721,1.358h2.025l0.727-1.358H19.697z',
  car: 'path://M49.592,40.883c-0.053,0.354-0.139,0.697-0.268,0.963c-0.232,0.475-0.455,0.519-1.334,0.475 c-1.135-0.053-2.764,0-4.484,0.068c0,0.476,0.018,0.697,0.018,0.697c0.111,1.299,0.697,1.342,0.931,1.342h3.7 c0.326,0,0.628,0,0.861-0.154c0.301-0.196,0.43-0.772,0.543-1.78c0.017-0.146,0.025-0.336,0.033-0.56v-0.01 c0-0.068,0.008-0.154,0.008-0.25V41.58l0,0C49.6,41.348,49.6,41.09,49.592,40.883L49.592,40.883z M6.057,40.883 c0.053,0.354,0.137,0.697,0.268,0.963c0.23,0.475,0.455,0.519,1.334,0.475c1.137-0.053,2.762,0,4.484,0.068 c0,0.476-0.018,0.697-0.018,0.697c-0.111,1.299-0.697,1.342-0.93,1.342h-3.7c-0.328,0-0.602,0-0.861-0.154 c-0.309-0.18-0.43-0.772-0.541-1.78c-0.018-0.146-0.027-0.336-0.035-0.56v-0.01c0-0.068-0.008-0.154-0.008-0.25V41.58l0,0 C6.057,41.348,6.057,41.09,6.057,40.883L6.057,40.883z M49.867,32.766c0-2.642-0.344-5.224-0.482-5.507 c-0.104-0.207-0.766-0.749-2.271-1.773c-1.522-1.042-1.487-0.887-1.766-1.566c0.25-0.078,0.492-0.224,0.639-0.241 c0.326-0.034,0.345,0.274,1.023,0.274c0.68,0,2.152-0.18,2.453-0.48c0.301-0.303,0.396-0.405,0.396-0.672 c0-0.268-0.156-0.818-0.447-1.146c-0.293-0.327-1.541-0.49-2.273-0.585c-0.729-0.095-0.834,0-1.022,0.121 c-0.304,0.189-0.32,1.919-0.32,1.919l-0.713,0.018c-0.465-1.146-1.11-3.452-2.117-5.269c-1.103-1.979-2.256-2.599-2.737-2.754 c-0.474-0.146-0.904-0.249-4.131-0.576c-3.298-0.344-5.922-0.388-8.262-0.388c-2.342,0-4.967,0.052-8.264,0.388 c-3.229,0.336-3.66,0.43-4.133,0.576s-1.633,0.775-2.736,2.754c-1.006,1.816-1.652,4.123-2.117,5.269L9.87,23.109 c0,0-0.008-1.729-0.318-1.919c-0.189-0.121-0.293-0.225-1.023-0.121c-0.732,0.104-1.98,0.258-2.273,0.585 c-0.293,0.327-0.447,0.878-0.447,1.146c0,0.267,0.094,0.379,0.396,0.672c0.301,0.301,1.773,0.48,2.453,0.48 c0.68,0,0.697-0.309,1.023-0.274c0.146,0.018,0.396,0.163,0.637,0.241c-0.283,0.68-0.24,0.524-1.764,1.566 c-1.506,1.033-2.178,1.566-2.271,1.773c-0.139,0.283-0.482,2.865-0.482,5.508s0.189,5.02,0.189,5.86c0,0.354,0,0.976,0.076,1.565 c0.053,0.354,0.129,0.697,0.268,0.966c0.232,0.473,0.447,0.516,1.334,0.473c1.137-0.051,2.779,0,4.477,0.07 c1.135,0.043,2.297,0.086,3.33,0.11c2.582,0.051,1.826-0.379,2.928-0.36c1.102,0.016,5.447,0.196,9.424,0.196 c3.976,0,8.332-0.182,9.423-0.196c1.102-0.019,0.346,0.411,2.926,0.36c1.033-0.018,2.195-0.067,3.332-0.11 c1.695-0.062,3.348-0.121,4.477-0.07c0.886,0.043,1.103,0,1.332-0.473c0.132-0.269,0.218-0.611,0.269-0.966 c0.086-0.592,0.078-1.213,0.078-1.565C49.678,37.793,49.867,35.408,49.867,32.766L49.867,32.766z M13.219,19.735 c0.412-0.964,1.652-2.9,2.256-3.244c0.145-0.087,1.426-0.491,4.637-0.706c2.953-0.198,6.217-0.276,7.73-0.276 c1.513,0,4.777,0.078,7.729,0.276c3.201,0.215,4.502,0.611,4.639,0.706c0.775,0.533,1.842,2.28,2.256,3.244 c0.412,0.965,0.965,2.858,0.861,3.116c-0.104,0.258,0.104,0.388-1.291,0.275c-1.387-0.103-10.088-0.216-14.185-0.216 c-4.088,0-12.789,0.113-14.184,0.216c-1.395,0.104-1.188-0.018-1.291-0.275C12.254,22.593,12.805,20.708,13.219,19.735 L13.219,19.735z M16.385,30.511c-0.619,0.155-0.988,0.491-1.764,0.482c-0.775,0-2.867-0.353-3.314-0.371 c-0.447-0.017-0.842,0.302-1.076,0.362c-0.23,0.06-0.688-0.104-1.377-0.318c-0.688-0.216-1.092-0.155-1.316-1.094 c-0.232-0.93,0-2.264,0-2.264c1.488-0.068,2.928,0.069,5.621,0.826c2.693,0.758,4.191,2.213,4.191,2.213 S17.004,30.357,16.385,30.511L16.385,30.511z M36.629,37.293c-1.23,0.164-6.386,0.207-8.794,0.207c-2.412,0-7.566-0.051-8.799-0.207 c-1.256-0.164-2.891-1.67-1.764-2.865c1.523-1.627,1.24-1.576,4.701-2.023C24.967,32.018,27.239,32,27.834,32 c0.584,0,2.865,0.025,5.859,0.404c3.461,0.447,3.178,0.396,4.699,2.022C39.521,35.623,37.887,37.129,36.629,37.293L36.629,37.293z  M48.129,29.582c-0.232,0.93-0.629,0.878-1.318,1.093c-0.688,0.216-1.145,0.371-1.377,0.319c-0.231-0.053-0.627-0.371-1.074-0.361 c-0.448,0.018-2.539,0.37-3.313,0.37c-0.772,0-1.146-0.328-1.764-0.481c-0.621-0.154-0.966-0.154-0.966-0.154 s1.49-1.464,4.191-2.213c2.693-0.758,4.131-0.895,5.621-0.826C48.129,27.309,48.361,28.643,48.129,29.582L48.129,29.582z'
};
const labelSetting = {
  show: true,
  position: 'right',
  offset: [10, 0],
  fontSize: 16
};
function makeOption(type, symbol) {
  return {
    title: {
      text: '东北三省上市国企和民企数量对比（不含合资企业）',
      subtext: '数据来源：A股公报',
      left: 'center'
    },
    toolbox: {
      feature: {
        saveAsImage: {}
      }
    },  
    legend: {
      data: ['国企', '民营企业'],
      bottom: 0,
      left: 'center'
    },
    tooltip: {
      trigger: 'axis',
      axisPointer: {
        type: 'shadow'
      }
    },
    grid: {
      containLabel: true,
      left: 20
    },
    yAxis: {
      data: ['黑龙江', '吉林', '辽宁', '四川', '湖北'],
      inverse: true,
      axisLine: { show: false },
      axisTick: { show: false },
      axisLabel: {
        margin: 30,
        fontSize: 14
      },
      axisPointer: {
        label: {
          show: true,
          margin: 30
        }
      }
    },
    xAxis: {
      splitLine: { show: false },
      axisLabel: { show: false },
      axisTick: { show: false },
      axisLine: { show: false }
    },
    animationDurationUpdate: 500,
    series: [
      {
        name: '国企',
        id: 'bar1',
        type: type,
        label: labelSetting,
        symbolRepeat: true,
        symbolSize: ['80%', '60%'],
        barCategoryGap: '40%',
        universalTransition: {
          enabled: true,
          delay: function (idx, total) {
            return (idx / total) * 1000;
          }
        },
        data: [
          {
            value: 22,
            symbol: symbol || pathSymbols.reindeer
          },
          {
            value: 22,
            symbol: symbol || pathSymbols.ship
          },
          {
            value: 44,
            symbol: symbol || pathSymbols.plane
          },
          {
            value: 49,
            symbol: symbol || pathSymbols.train
          },
          {
            value: 52,
            symbol: symbol || pathSymbols.car
          }
        ]
      },
      {
        name: '民营企业',
        id: 'bar2',
        type: type,
        barGap: '10%',
        label: labelSetting,
        symbolRepeat: true,
        symbolSize: ['80%', '60%'],
        universalTransition: {
          enabled: true,
          delay: function (idx, total) {
            return (idx / total) * 1000;
          }
        },
        data: [
          {
            value: 22,
            symbol: symbol || pathSymbols.reindeer
          },
          {
            value: 31,
            symbol: symbol || pathSymbols.ship
          },
          {
            value: 42,
            symbol: symbol || pathSymbols.plane
          },
          {
            value: 107,
            symbol: symbol || pathSymbols.train
          },
          {
            value: 76,
            symbol: symbol || pathSymbols.car
          }
        ]
      }
    ]
  };
}
const options = [
  makeOption('pictorialBar'),
  makeOption('bar'),
  makeOption('pictorialBar', 'diamond')
];
var optionIndex = 0;
gqPercentageOption = options[optionIndex];
setInterval(function () {
  optionIndex = (optionIndex + 1) % options.length;
  gqPercentage.setOption(options[optionIndex]);
}, 2500);

gqPercentageOption && gqPercentage.setOption(gqPercentageOption);

// 专利数量
var zhuanliDOM = document.getElementById('zhuanli');
var zhuanli = echarts.init(zhuanliDOM, theme='dark');
var zhuanliOption;

let dataAxis = [
  '广东',
  '上海',
  '浙江',
  '江苏',
  '北京',
  '山东',
  '辽宁',
  '四川',
  '福建',
  '天津',
  '湖北',
  '湖南',
  '河北',
  '河南',
  '黑龙江',
  '重庆',
  '吉林',
  '陕西',
  '安徽',
  '江西',
  '广西',
  '云南',
  '山西',
  '新疆',
  '内蒙古',
  '贵州',
  '甘肃',
  '海南',
  '宁夏',
  '青海',
  '西藏',
  ];
let zhuanliData = [43186,
  22374,
  21463,
  18393,
  17003,
  15794,
  13545,
  7443,
  7236,
  6812,
  6635,
  6054,
  5623,
  5261,
  4972,
  4589,
  4267,
  3421,
  2676,
  2434,
  2250,
  1966,
  1743,
  1473,
  1393,
  1242,
  961,
  445,
  441,
  173,
  24,
  ];
let dataAxis2 = [
'广东',
'江苏',
'浙江',
'山东',
'北京',
'上海',
'安徽',
'河南',
'福建',
'湖北',
'四川',
'湖南',
'河北',
'天津',
'江西',
'陕西',
'辽宁',
'重庆',
'广西',
'贵州',
'云南',
'黑龙江',
'山西',
'吉林',
'甘肃',
'内蒙古',
'新疆',
'海南',
'宁夏',
'青海',
'西藏',
]
let zhuanliData2 = [
  967204,
  719452,
  507050,
  337280,
  254165,
  210293,
  202298,
  178585,
  174867,
  163613,
  160036,
  128573,
  125608,
  111514,
  109738,
  99236,
  86527,
  83826,
  51712,
  49200,
  45153,
  43252,
  40302,
  34438,
  30732,
  26224,
  18843,
  14360,
  12172,
  6736,
  2296,
]
let yMax = 500;
let dataShadow = [];
for (let i = 0; i < data.length; i++) {
  dataShadow.push(yMax);
}
zhuanliOption = {
  title: [
    {
      text: '2003年全国各省市专利申请数量',
      subtext: '数据来源：《2003年中国统计年鉴》',
      left: 'center'
    },
    {
      text: '2020年全国各省市专利申请数量',
      subtext: '数据来源：《2003年中国统计年鉴》',
      left: 'center',
      top: '50%'
    },
  ],
  toolbox: {
    feature: {
      saveAsImage: {}
    }
  },  
  backgroundColor: 'transparent',
  tooltip: {
    valueFormatter: function (value) {
      return value + ' 件';
    }
  },
  xAxis: [
    {
      data: dataAxis,
      axisTick: {
        show: false
      },
      axisLine: {
        show: false
      },
      z: 10,
      axisLabel: {
        //x轴文字的配置
        show: true,
        interval: 0,//使x轴文字显示全
       }
    },
    {
      data: dataAxis2,
      axisTick: {
        show: false
      },
      axisLine: {
        show: false
      },
      z: 10,
      axisLabel: {
        //x轴文字的配置
        show: true,
        interval: 0,//使x轴文字显示全
       },
       gridIndex: 1
    },
  ],
  yAxis: [
    {
      axisLine: {
        show: false
      },
      axisTick: {
        show: false
      },
      axisLabel: {
        color: '#999'
      },
    },
    {
      axisLine: {
        show: false
      },
      axisTick: {
        show: false
      },
      axisLabel: {
        color: '#999'
      },
      gridIndex: 1
    },
  ],
  grid: [
    {
      bottom: '60%'
    },
    {
      top: '60%'
    }
  ],
  dataZoom: [
    {
      type: 'inside'
    },
    {
      type: 'inside',
      xAxisIndex: 1,
      yAxisIndex: 1
    }
  ],
  series: [
    {
      type: 'bar',
      showBackground: true,
      itemStyle: {
        color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
          { offset: 0, color: '#83bff6' },
          { offset: 0.5, color: '#188df0' },
          { offset: 1, color: '#188df0' }
        ])
      },
      emphasis: {
        itemStyle: {
          color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
            { offset: 0, color: '#2378f7' },
            { offset: 0.7, color: '#2378f7' },
            { offset: 1, color: '#83bff6' }
          ])
        }
      },
      data: zhuanliData
    },
    {
      type: 'bar',
      showBackground: true,
      itemStyle: {
        color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
          { offset: 0, color: '#83bff6' },
          { offset: 0.5, color: '#188df0' },
          { offset: 1, color: '#188df0' }
        ])
      },
      emphasis: {
        itemStyle: {
          color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
            { offset: 0, color: '#2378f7' },
            { offset: 0.7, color: '#2378f7' },
            { offset: 1, color: '#83bff6' }
          ])
        }
      },
      data: zhuanliData2,
      xAxisIndex: 1,
      yAxisIndex: 1
    },
  ]
};
const zoomSize = 6;
zhuanli.on('click', function (params) {
  zhuanli.dispatchAction({
    type: 'dataZoom',
    startValue: dataAxis[Math.max(params.dataIndex - zoomSize / 2, 0)],
    endValue:
      dataAxis[Math.min(params.dataIndex + zoomSize / 2, data.length - 1)]
  });
});
zhuanli.on('click', function (params) {
  zhuanli.dispatchAction({
    type: 'dataZoom',
    startValue: dataAxis2[Math.max(params.dataIndex - zoomSize / 2, 0)],
    endValue:
      dataAxis2[Math.min(params.dataIndex + zoomSize / 2, data.length - 1)]
  });
});

zhuanliOption && zhuanli.setOption(zhuanliOption);